from utils.color import Color  # Імпорт класу Color

class Figure:
    """
    Базовий клас для створення геометричних фігур із можливістю налаштування розміру та кольору.

    Атрибути:
        size (int): Розмір фігури.
        color (str): Колір фігури, отриманий за допомогою класу Color.

    Методи:
        render(): Абстрактний метод для відображення фігури. Повинен бути реалізований у підкласах.
    """

    def __init__(self, size: int, color: str):
        """
        Ініціалізує об'єкт класу Figure.

        Параметри:
            size (int): Розмір фігури.
            color (str): Назва кольору, який буде конвертовано у формат за допомогою класу Color.
        """
        self.size = size
        self.color = Color.get_color(color)  # Використання класу Color для отримання кольору

    def render(self):
        """
        Абстрактний метод для відображення фігури.

        Цей метод повинен бути реалізований у похідних класах.
        """
        raise NotImplementedError("Метод render повинен бути реалізований у підкласах.")
