"""
Цей модуль містить клас BasePlot для створення, 
відображення та збереження графіків 
за допомогою бібліотеки Matplotlib.

Клас BasePlot надає базову функціональність 
для роботи з графіками, включаючи методи 
для їх відображення на екрані
та збереження в різних 
форматах файлів (наприклад, PNG, PDF, JPG).

Методи:
--------
- show(): Відображає графік у вікні.
- save(filename, img_format="png"): Зберігає графік у файл з вказаним ім'ям і форматом.
"""
import matplotlib.pyplot as plt

class BasePlot:
    """
    Клас для базового створення та збереження 
    графіків за допомогою бібліотеки Matplotlib.
    Методи:
    --------
    show() :
        Відображає графік у вікні за допомогою Matplotlib та закриває його після відображення.
    save(filename, format="png") :
        Зберігає поточний графік у файл з вказаним ім'ям та форматом (за замовчуванням PNG).
        Параметри:
            - filename (str): Ім'я файлу для збереження графіка.
            - format (str): Формат файлу для збереження 
            (наприклад, "png", "pdf", "jpg"). 
            За замовчуванням використовується "png".
    """
    def show(self):
        """
        Відображає графік у вікні та закриває його після відображення.
        """
        plt.show()
        plt.close()
    def save(self, filename, img_format="png"):
        """
        Зберігає поточний графік у файл.
        
        Параметри:
        -----------
        filename : str
            Ім'я файлу, куди буде збережено графік.
        
        format : str, optional
            Формат збереженого файлу. За замовчуванням "png".
        """
        plt.savefig(f"{filename}.{img_format}", format=img_format)
        plt.close()
